In [1]:
%matplotlib notebook

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

sns.set_style("dark")

In [4]:
df = pd.read_csv("Employees.csv")
df.head(10)

,NAME,JOB TITLE,DEPARTMENT,EMPLOYEE ANNUAL SALARY,ESTIMATED ANNUAL SALARY MINUS FURLOUGHS
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$81000.00,$73862.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$74628.00,$74628.00
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,FLEET MANAGEMNT,$77280.00,$70174.00
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$96276.00,$96276.00
4,"ABBATACOLA, ROBERT J",ELECTRICAL MECHANIC,WATER MGMNT,$84032.00,$76627.00
5,"ABBATE, TERRY M",POLICE OFFICER,POLICE,$79926.00,$79926.00
6,"ABBATEMARCO, JAMES J",FIREFIGHTER,FIRE,$77238.00,$77238.00
7,"ABBOTT, BETTY L",FOSTER GRANDPARENT,FAMILY & SUPPORT,$2756.00,$2756.00
8,"ABBOTT, LYNISE M",CLERK III,FAMILY & SUPPORT,$38568.00,$38568.00
9,"ABBOTT, SAM J",ELECTRICAL MECHANIC,TRANSPORTN,$84032.00,$76627.00

In [6]:
df.drop("NAME", axis = 1, inplace = True)

In [9]:
df.shape

(34218, 4)

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34218 entries, 0 to 34217
Data columns (total 4 columns):
 #   Column                                   Non-Null Count  Dtype
---  ------                                   --------------  -----
 0   JOB TITLE                                34218 non-null  object
 1   DEPARTMENT                               34218 non-null  object
 2   EMPLOYEE ANNUAL SALARY                   34218 non-null  object
 3   ESTIMATED ANNUAL SALARY MINUS FURLOUGHS  34218 non-null  object
dtypes: object(4)
memory usage: 1.0+ MB

In [13]:
len(df["JOB TITLE"].unique())

1124

In [15]:
len(df["DEPARTMENT"].unique())

39

In [17]:
df.describe()

,JOB TITLE,DEPARTMENT,EMPLOYEE ANNUAL SALARY,ESTIMATED ANNUAL SALARY MINUS FURLOUGHS
count,34218,34218,34218,34218
unique,1124,39,1028,1088
top,POLICE OFFICER,POLICE,$77238.00,$77238.00
freq,10918,14147,3028,3028